[
  
        {
            "id": "1",
            "title": "cd command",
            "description": "The cd command is one of the most used Linux commands. The purpose of this command is to change the directory. This cd command, popularly called chdir (change directory), is a code administrative command used in several versions of Windows that can modify the home directory. It could be applied in routine programs and terminal scripts. In other words, it enables to switch between file lists. For example, if you needed to shift from the home directory to the myfile directory, you would enter the following command:",
            "command": " cd/myfile/application "
        },
        {
            "id": "2",
            "title": " ls command ",
            "description": "The ls command is the most common and the most useful command in the Linux environment. The ls command is also called as the list command which works in the Linux terminal to display all of the important folders or directories listed under a particular file system. For instance, the command: ",
            "command": " ls /myfiles "
        },
        {
            "id": "3",
            "title": " man command",
            "description": " The man command is one of the best Linux commands. This command is also known as the manual command. The man command is just a designed help system for Linux commands. It permits individuals to search the reference manuals for authorities and other utilities executed in the interface. A command explanation, appropriate parameters, variables, illustrations, and other helpful parts may all be found on the man site (brief for handbook page). It is used to display the manual use of the inserted command. In other words, it is the meta-command of Linux. Entering the man command will display all the information about the command ",
            "command": " man ls "
        },
        {
            "id": "4",
            "title": " ",
            "description": " ",
            "command": "  "
        },
        {
            "id": "5",
            "title": " cat command ",
            "description": "The cat Linux command is a short form of concatenate. This cat command is a Linux utility tool. Printing the contents of a file to the ordinary output sequence is an item of Edmond’s most incredible well-known applications. Aside from it, a cat command may be used to save a little text to either a file. It lists the information of files to the Linux terminal window. This is much quicker than opening the file in an editor. If you want to read the data of .bash_log_out file, enter the following command: ",
            "command": " cat .bash_logout "
        },
        {
            "id": "6",
            "title": "mkdir command ",
            "description": " mkdir Linux is one of the basic Linux commands in the environment. As the name suggests, this command is used to make a directory or in other words, it used to create a directory. The following command will create a new folder called a test folder. An example of the mkdir command:",
            "command": " mkdir testfolder "
        },
        {
            "id": "7",
            "title": "  chmod command",
            "description": " The chmod command is used to set the file permission or a flag on a folder or a file. The flags describe who can read, write into the file or a folder. This is one of the most crucial commands of the Linux environment. It is widely used by administrators. For example,",
            "command": "chmod -R 7 test.txt   "
        },
        {
            "id": "8",
            "title": " rmdir command",
            "description": " Just like the mkdir Linux command, rmdir is also one of the most used commands. This command allows users to remove any file or directory from a particular location. In other words, you can use this command to delete a particular directory. For example, the following command will remove the mydirectory from the system.",
            "command": "rmdir mydirectory  "
        },
        {
            "id": "9",
            "title": " touch command",
            "description": "The touch command is just like a mkdir command. The touch command is standard in UNIX/Linux Linux kernel for creating, changing, and modifying file timing information. It’s used to make a file that doesn’t have any content. The touch command generated an unfilled directory. The main difference between touch command and mkdir is that the touch command allows its users to create a text file or a .doc file.  For example, ",
            "command": " touch mytestfile.txt  "
        },
        {
            "id": "10",
            "title": " locate command",
            "description": "The locate command is also called as the find command. This command is used to find or locate a particular file. This command is one of the common Linux commands. If you don’t know the exact name of the file or the exact destination of the particular file then this command is very useful. The following command will locate the file which contains the words “result”, “final” “total”",
            "command": " locate -i *result*final**total* "
        }
    ]
